; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-5-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-8 - location
	p1-2 - location
	p1-3 - location
	p2-0 - location
	p3-8 - location
	p3-10 - location
	p4-7 - location
	p4-9 - location
	p4-10 - location
	p5-10 - location
	p7-1 - location
	p7-3 - location
	p7-5 - location
	p7-6 - location
	p9-1 - location
	p9-4 - location
	p9-5 - location
	p10-1 - location
	p10-6 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s5)
	(at driver3 s7)
	(at driver4 s2)
	(at driver5 s3)
	(at truck1 s7)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s9)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s6)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s4)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s10)
	(at package2 s10)
	(at package3 s1)
	(at package4 s1)
	(at package5 s9)
	(at package6 s0)
	(at package7 s10)
	(at package8 s5)
	(at package9 s2)
	(at package10 s6)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s10 p10-1)
	(path p10-1 s10)
	(path s1 p10-1)
	(path p10-1 s1)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 59)
	(= (time-to-drive s3 s0) 59)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 99)
	(= (time-to-drive s4 s0) 99)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 13)
	(= (time-to-drive s10 s0) 13)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 65)
	(= (time-to-drive s0 s2) 65)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 35)
	(= (time-to-drive s5 s2) 35)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 20)
	(= (time-to-drive s7 s2) 20)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 63)
	(= (time-to-drive s8 s2) 63)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 88)
	(= (time-to-drive s9 s2) 88)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 15)
	(= (time-to-drive s4 s3) 15)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 86)
	(= (time-to-drive s8 s3) 86)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 38)
	(= (time-to-drive s2 s4) 38)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 17)
	(= (time-to-drive s8 s4) 17)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 7)
	(= (time-to-drive s1 s5) 7)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 21)
	(= (time-to-drive s8 s5) 21)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 18)
	(= (time-to-drive s0 s6) 18)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 10)
	(= (time-to-drive s4 s6) 10)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 67)
	(= (time-to-drive s9 s6) 67)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 66)
	(= (time-to-drive s10 s6) 66)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 53)
	(= (time-to-drive s3 s7) 53)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 49)
	(= (time-to-drive s5 s7) 49)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 38)
	(= (time-to-drive s10 s7) 38)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 39)
	(= (time-to-drive s0 s8) 39)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 26)
	(= (time-to-drive s1 s8) 26)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 72)
	(= (time-to-drive s7 s8) 72)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 6)
	(= (time-to-drive s1 s9) 6)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 100)
	(= (time-to-drive s3 s10) 100)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 92)
	(= (time-to-drive s4 s10) 92)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver3 s10)
	(at driver4 s9)
	(at truck1 s4)
	(at truck2 s3)
	(at truck3 s7)
	(at truck4 s6)
	(at package1 s5)
	(at package2 s10)
	(at package3 s7)
	(at package4 s10)
	(at package5 s2)
	(at package6 s10)
	(at package7 s9)
	(at package8 s4)
	(at package9 s4)
	(at package10 s8)
	))

(:metric minimize (+ (* 3 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver4 s2 p2-0)
   deleted: (at driver4 s2)
   added: (at driver4 p2-0)
   goals met: 1 of 16
2. (load-truck package6 truck4 s0)
   deleted: (at package6 s0)
   added: (in package6 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 1 of 16
3. (board-truck driver3 truck1 s7)
   deleted: (at driver3 s7) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 1 of 16
4. (walk driver1 s5 p9-5)
   deleted: (at driver1 s5)
   added: (at driver1 p9-5)
   goals met: 1 of 16
5. (load-truck package5 truck2 s9)
   deleted: (at package5 s9)
   added: (in package5 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 1 of 16
6. (walk driver1 p9-5 s9)
   deleted: (at driver1 p9-5)
   added: (at driver1 s9)
   goals met: 1 of 16
7. (drive-truck truck1 s7 s10 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s10)
   changed: (fuel-used) from 0 to 380
   goals met: 1 of 16
8. (load-truck package1 truck1 s10)
   deleted: (at package1 s10)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 16
9. (walk driver4 p2-0 s0)
   deleted: (at driver4 p2-0)
   added: (at driver4 s0)
   goals met: 1 of 16
10. (load-truck package7 truck1 s10)
   deleted: (at package7 s10)
   added: (in package7 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 16
11. (board-truck driver1 truck2 s9)
   deleted: (at driver1 s9) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 16
12. (drive-truck truck1 s10 s4 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s4)
   changed: (fuel-used) from 380 to 1576
   goals met: 2 of 16
13. (drive-truck truck2 s9 s6 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s6)
   changed: (fuel-used) from 1576 to 2313
   goals met: 2 of 16
14. (disembark-truck driver1 truck2 s6)
   deleted: (driving driver1 truck2)
   added: (at driver1 s6) (empty truck2)
   goals met: 2 of 16
15. (unload-truck package5 truck2 s6)
   deleted: (in package5 truck2)
   added: (at package5 s6)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 2 of 16
16. (drive-truck truck1 s4 s2 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 2313 to 2807
   goals met: 1 of 16
17. (drive-truck truck1 s2 s9 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s9)
   changed: (fuel-used) from 2807 to 3951
   goals met: 1 of 16
18. (unload-truck package7 truck1 s9)
   deleted: (in package7 truck1)
   added: (at package7 s9)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 2 of 16
19. (board-truck driver4 truck4 s0)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 2 of 16
20. (drive-truck truck4 s0 s6 driver4)
   deleted: (at truck4 s0)
   added: (at truck4 s6)
   changed: (fuel-used) from 3951 to 4149
   goals met: 3 of 16
21. (drive-truck truck1 s9 s2 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s2)
   changed: (fuel-used) from 4149 to 5117
   goals met: 3 of 16
22. (drive-truck truck4 s6 s10 driver4)
   deleted: (at truck4 s6)
   added: (at truck4 s10)
   changed: (fuel-used) from 5117 to 5843
   goals met: 2 of 16
23. (unload-truck package6 truck4 s10)
   deleted: (in package6 truck4)
   added: (at package6 s10)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 3 of 16
24. (load-truck package9 truck1 s2)
   deleted: (at package9 s2)
   added: (in package9 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 16
25. (drive-truck truck1 s2 s5 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (fuel-used) from 5843 to 6298
   goals met: 3 of 16
26. (drive-truck truck4 s10 s6 driver4)
   deleted: (at truck4 s10)
   added: (at truck4 s6)
   changed: (fuel-used) from 6298 to 6958
   goals met: 4 of 16
27. (load-truck package8 truck1 s5)
   deleted: (at package8 s5)
   added: (in package8 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 4 of 16
28. (load-truck package10 truck4 s6)
   deleted: (at package10 s6)
   added: (in package10 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 4 of 16
29. (drive-truck truck4 s6 s9 driver4)
   deleted: (at truck4 s6)
   added: (at truck4 s9)
   changed: (fuel-used) from 6958 to 7695
   goals met: 3 of 16
30. (unload-truck package1 truck1 s5)
   deleted: (in package1 truck1)
   added: (at package1 s5)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 4 of 16
31. (drive-truck truck1 s5 s8 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s8)
   changed: (fuel-used) from 7695 to 7968
   goals met: 4 of 16
32. (drive-truck truck1 s8 s4 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   changed: (fuel-used) from 7968 to 8189
   goals met: 5 of 16
33. (unload-truck package8 truck1 s4)
   deleted: (in package8 truck1)
   added: (at package8 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 6 of 16
34. (unload-truck package9 truck1 s4)
   deleted: (in package9 truck1)
   added: (at package9 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 16
35. (drive-truck truck1 s4 s10 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s10)
   changed: (fuel-used) from 8189 to 9109
   goals met: 6 of 16
36. (disembark-truck driver3 truck1 s10)
   deleted: (driving driver3 truck1)
   added: (at driver3 s10) (empty truck1)
   goals met: 7 of 16
37. (board-truck driver1 truck3 s6)
   deleted: (at driver1 s6) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 16
38. (drive-truck truck4 s9 s2 driver4)
   deleted: (at truck4 s9)
   added: (at truck4 s2)
   changed: (fuel-used) from 9109 to 10077
   goals met: 7 of 16
39. (load-truck package5 truck3 s6)
   deleted: (at package5 s6)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 7 of 16
40. (drive-truck truck3 s6 s9 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s9)
   changed: (fuel-used) from 10077 to 10814
   goals met: 7 of 16
41. (drive-truck truck4 s2 s9 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s9)
   changed: (fuel-used) from 10814 to 11782
   goals met: 7 of 16
42. (drive-truck truck4 s9 s6 driver4)
   deleted: (at truck4 s9)
   added: (at truck4 s6)
   changed: (fuel-used) from 11782 to 12519
   goals met: 8 of 16
43. (disembark-truck driver4 truck4 s6)
   deleted: (driving driver4 truck4)
   added: (at driver4 s6) (empty truck4)
   goals met: 8 of 16
44. (board-truck driver4 truck2 s6)
   deleted: (at driver4 s6) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 8 of 16
45. (drive-truck truck3 s9 s2 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s2)
   changed: (fuel-used) from 12519 to 13487
   goals met: 8 of 16
46. (unload-truck package5 truck3 s2)
   deleted: (in package5 truck3)
   added: (at package5 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 9 of 16
47. (drive-truck truck3 s2 s7 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s7)
   changed: (fuel-used) from 13487 to 13687
   goals met: 10 of 16
48. (unload-truck package10 truck4 s6)
   deleted: (in package10 truck4)
   added: (at package10 s6)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 10 of 16
49. (load-truck package10 truck2 s6)
   deleted: (at package10 s6)
   added: (in package10 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 10 of 16
50. (drive-truck truck2 s6 s9 driver4)
   deleted: (at truck2 s6)
   added: (at truck2 s9)
   changed: (fuel-used) from 13687 to 14424
   goals met: 10 of 16
51. (drive-truck truck2 s9 s1 driver4)
   deleted: (at truck2 s9)
   added: (at truck2 s1)
   changed: (fuel-used) from 14424 to 14490
   goals met: 10 of 16
52. (load-truck package3 truck2 s1)
   deleted: (at package3 s1)
   added: (in package3 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 10 of 16
53. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 10 of 16
54. (drive-truck truck2 s1 s8 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s8)
   changed: (fuel-used) from 14490 to 14906
   goals met: 10 of 16
55. (drive-truck truck2 s8 s7 driver4)
   deleted: (at truck2 s8)
   added: (at truck2 s7)
   changed: (fuel-used) from 14906 to 16058
   goals met: 10 of 16
56. (unload-truck package3 truck2 s7)
   deleted: (in package3 truck2)
   added: (at package3 s7)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 11 of 16
57. (drive-truck truck2 s7 s10 driver4)
   deleted: (at truck2 s7)
   added: (at truck2 s10)
   changed: (fuel-used) from 16058 to 16552
   goals met: 11 of 16
58. (drive-truck truck2 s10 s6 driver4)
   deleted: (at truck2 s10)
   added: (at truck2 s6)
   changed: (fuel-used) from 16552 to 17410
   goals met: 11 of 16
59. (drive-truck truck2 s6 s9 driver4)
   deleted: (at truck2 s6)
   added: (at truck2 s9)
   changed: (fuel-used) from 17410 to 18281
   goals met: 11 of 16
60. (board-truck driver3 truck1 s10)
   deleted: (at driver3 s10) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 10 of 16
61. (drive-truck truck1 s10 s4 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s4)
   changed: (fuel-used) from 18281 to 19201
   goals met: 11 of 16
62. (drive-truck truck2 s9 s2 driver4)
   deleted: (at truck2 s9)
   added: (at truck2 s2)
   changed: (fuel-used) from 19201 to 20345
   goals met: 11 of 16
63. (unload-truck package4 truck2 s2)
   deleted: (in package4 truck2)
   added: (at package4 s2)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 11 of 16
64. (drive-truck truck1 s4 s10 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s10)
   changed: (fuel-used) from 20345 to 21265
   goals met: 10 of 16
65. (disembark-truck driver3 truck1 s10)
   deleted: (driving driver3 truck1)
   added: (at driver3 s10) (empty truck1)
   goals met: 11 of 16
66. (drive-truck truck2 s2 s8 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s8)
   changed: (fuel-used) from 21265 to 21958
   goals met: 11 of 16
67. (unload-truck package10 truck2 s8)
   deleted: (in package10 truck2)
   added: (at package10 s8)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 12 of 16
68. (drive-truck truck2 s8 s1 driver4)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   changed: (fuel-used) from 21958 to 22218
   goals met: 12 of 16
69. (drive-truck truck3 s7 s2 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   changed: (fuel-used) from 22218 to 22418
   goals met: 11 of 16
70. (load-truck package4 truck3 s2)
   deleted: (at package4 s2)
   added: (in package4 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 11 of 16
71. (drive-truck truck3 s2 s7 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s7)
   changed: (fuel-used) from 22418 to 22638
   goals met: 12 of 16
72. (drive-truck truck3 s7 s10 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s10)
   changed: (fuel-used) from 22638 to 23056
   goals met: 11 of 16
73. (unload-truck package4 truck3 s10)
   deleted: (in package4 truck3)
   added: (at package4 s10)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 12 of 16
74. (drive-truck truck3 s10 s7 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s7)
   changed: (fuel-used) from 23056 to 23436
   goals met: 13 of 16
75. (drive-truck truck2 s1 s9 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s9)
   changed: (fuel-used) from 23436 to 23496
   goals met: 13 of 16
76. (drive-truck truck2 s9 s6 driver4)
   deleted: (at truck2 s9)
   added: (at truck2 s6)
   changed: (fuel-used) from 23496 to 24166
   goals met: 13 of 16
77. (drive-truck truck2 s6 s4 driver4)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   changed: (fuel-used) from 24166 to 24266
   goals met: 13 of 16
78. (disembark-truck driver4 truck2 s4)
   deleted: (driving driver4 truck2)
   added: (at driver4 s4) (empty truck2)
   goals met: 13 of 16
79. (walk driver4 s4 p4-9)
   deleted: (at driver4 s4)
   added: (at driver4 p4-9)
   goals met: 13 of 16
80. (walk driver4 p4-9 s9)
   deleted: (at driver4 p4-9)
   added: (at driver4 s9)
   goals met: 14 of 16
81. (board-truck driver3 truck1 s10)
   deleted: (at driver3 s10) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 13 of 16
82. (drive-truck truck1 s10 s4 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s4)
   changed: (fuel-used) from 24266 to 25186
   goals met: 14 of 16
83. (disembark-truck driver3 truck1 s4)
   deleted: (driving driver3 truck1)
   added: (at driver3 s4) (empty truck1)
   goals met: 14 of 16
84. (walk driver3 s4 p4-10)
   deleted: (at driver3 s4)
   added: (at driver3 p4-10)
   goals met: 14 of 16
85. (walk driver3 p4-10 s10)
   deleted: (at driver3 p4-10)
   added: (at driver3 s10)
   goals met: 15 of 16
86. (walk driver4 s9 p4-9)
   deleted: (at driver4 s9)
   added: (at driver4 p4-9)
   goals met: 14 of 16
87. (walk driver4 p4-9 s4)
   deleted: (at driver4 p4-9)
   added: (at driver4 s4)
   goals met: 14 of 16
88. (board-truck driver4 truck2 s4)
   deleted: (at driver4 s4) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 14 of 16
89. (drive-truck truck2 s4 s3 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 25186 to 25336
   goals met: 15 of 16
90. (disembark-truck driver4 truck2 s3)
   deleted: (driving driver4 truck2)
   added: (at driver4 s3) (empty truck2)
   goals met: 15 of 16
91. (drive-truck truck3 s7 s3 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s3)
   changed: (fuel-used) from 25336 to 25866
   goals met: 14 of 16
92. (walk driver4 s3 p1-3)
   deleted: (at driver4 s3)
   added: (at driver4 p1-3)
   goals met: 14 of 16
93. (drive-truck truck3 s3 s7 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s7)
   changed: (fuel-used) from 25866 to 26396
   goals met: 15 of 16
94. (walk driver4 p1-3 s1)
   deleted: (at driver4 p1-3)
   added: (at driver4 s1)
   goals met: 15 of 16
95. (walk driver4 s1 p9-1)
   deleted: (at driver4 s1)
   added: (at driver4 p9-1)
   goals met: 15 of 16
96. (walk driver4 p9-1 s9)
   deleted: (at driver4 p9-1)
   added: (at driver4 s9)
   goals met: 16 of 16
